app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
  def index
    @schools = School.all

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
---
  def show
    @school = School.find(params[:id])