app/controllers/students_controller.rb

  def new
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    student = Student.create(student_params)
---
INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "john doe"], ["age", 18], ["created_at", "2019-11-22 20:35:23.509844"], ["updated_at", "2019-11-22 20:35:23.509844"], ["school_id", 49]]

  def delete
    @student = Student.find(params[:id]) #define student to delete
    school = @student.school.id
    @student.destroy #delete student
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 2]]